/**
 * 关于ip 地址的基础知识
 *
 * 由4个字节，即32位二进制组成的一个逻辑地址，将这32位二进制分成4组，每组代表一个八位二进制数。
 *
 * 如果各个数字位上的数字全是 1 ，
 */
const ipCode = new Array(3).fill([]).map((item, index) => {
  if (!index) {
    return new Array(8).fill(1);
  } else if (index === 2) {
    return new Array(8).fill(2).map((base, i) => base ** (7 - i));
  } else if (index === 1) {
    return new Array(8).fill(2).map((base, i) => `${base}**${7 - i}`);
  }
});
console.log("查看八位二进制数的对应数字表:");
console.table(ipCode);
console.log(
  "这个ip段的数字，即是这个八位二进制数的十进制数: ",
  ipCode[2].reduce((a, b) => a + b)
);

/**
 * 从逻辑上分为网络号和主机号，
 * 网络号： 某一个完整的范围
 * 主机号：某一个独立的主机
 *
 * 网络号范围越大，容纳主机越多。反之亦然
 *
 * ip地址分类：A B C D E
 * A：它的前八位的第一位一定是0 [0,*,*,*,*,*,*,*]
 * B：它的前八位必须以10开头 [1,0,*,*,*,*,*,*]
 * C：[1,1,0,*,*,*,*,*]
 * D：[1,1,1,0,*,*,*,*]
 * E：[1,1,1,1,0,*,*,*]
 *
 * 私网ip：
 * 1：[00001010]
 * 2：[10101100][0001****]
 * 3：[11000000][10101000]
 */
